<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"ff7c57f5592436dbe68f19d6c622146550cffbec9d3b934af910ad26080b0605","plan_job_ref":"Job .github/workflows/_test-tf.yaml #62 at https://github.com/DND-IT/github-workflows/actions/runs/15458027607","plan_out_hash":"3424758f214dabfe392edc9288d367d7759e6cba949d65411929a36dcad88b93","plan_hash":"81815fb1eb7b4d3ab101671f54c9518bf7d890b89fc77d9e6503770c3adf4576","plan_text_format":"diff","version":"2.0.1"} -->
Terraform plan in __tests/terraform/s3__
With backend config: `bucket=tf-state-911453050078
key=sandbox1.tfstate
workspace_key_prefix=github-workflows
`
With var files: `tests/terraform/s3/environment/sandbox.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #62](https://github.com/DND-IT/github-workflows/actions/runs/15458027607)